tap "caskroom/cask"
tap "caskroom/versions"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"

brew "autoconf" # Automatic configure script builder
brew "automake" # Tool for generating GNU Standards-compliant Makefiles
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "git"
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "hivemind" # The mind to rule processes of your development environment
brew "hub" # Add GitHub support to git on the command-line
brew "eddieantonio/eddieantonio/imgcat" # It's like cat(1), but for images.
brew "libtool" # Generic library support script
brew "libyaml" # YAML Parser
brew "memcached", restart_service: true
brew "neovim"
brew "openssl@1.1"
brew "openssl"
brew "tmux" # Terminal multiplexer
brew "overmind"
brew "pkg-config" # Manage compile and link flags for libraries
brew "rabbitmq", restart_service: true
brew "readline" # Library for command-line editing
brew "redis", restart_service: true
brew "ripgrep"
brew "stow"
brew "tig" # Text interface for Git repositories
brew "trash" # CLI tool that moves files or folder to the trash
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-completions"

cask "chromedriver"
cask "ngrok"
