tap "caskroom/cask"
tap "caskroom/versions"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/core"
tap "homebrew/services"
tap "puma/puma"
tap "thoughtbot/formulae"
# Automatic configure script builder
brew "autoconf"
# Tool for generating GNU Standards-compliant Makefiles
brew "automake"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# GNU File, Shell, and Text utilities
brew "coreutils"
# Good-lookin' diffs with diff-highlight and more
brew "diff-so-fancy"
# SSL/TLS cryptography library
brew "openssl"
# Distributed revision control system
brew "git"
# GNU Pretty Good Privacy (PGP) package
brew "gnupg"
# The mind to rule processes of your development environment
brew "hivemind"
# Add GitHub support to git on the command-line
brew "hub"
# Generic library support script
brew "libtool"
# Library for command-line editing
brew "readline"
# YAML Parser
brew "libyaml"
# High performance, distributed memory object caching system
brew "memcached", restart_service: true
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Terminal multiplexer
brew "tmux"
# Process manager for Procfile-based applications and tmux
brew "overmind"
# Manage compile and link flags for libraries
brew "pkg-config"
# Object-relational database system
brew "postgresql@9.6", restart_service: true
# Messaging broker
brew "rabbitmq", restart_service: true
# Persistent key-value database, with built-in net interface
brew "redis", restart_service: true
# Search tool like grep and The Silver Searcher
brew "ripgrep"
# Text interface for Git repositories
brew "tig"
# CLI tool that moves files or folder to the trash
brew "trash"
# Vi 'workalike' with many additional features
brew "vim"
# JavaScript package manager
brew "yarn"
# UNIX shell (command interpreter)
brew "zsh"
# Additional completion definitions for zsh
brew "zsh-completions"
# It's like cat(1), but for images.
brew "eddieantonio/eddieantonio/imgcat"
# management suite for dotfiles
brew "thoughtbot/formulae/rcm"
cask "chromedriver"
cask "ngrok"
