tap "1password/tap"
tap "eddieantonio/eddieantonio"
tap "homebrew/bundle"
tap "homebrew/services"
tap "puma/puma"

brew "asdf" # Programming language version manager
brew "autoconf" # Automatic configure script builder
brew "automake" # Tool for generating GNU Standards-compliant Makefiles
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
brew "coreutils" # GNU File, Shell, and Text utilities
brew "diff-so-fancy" # Good-lookin' diffs with diff-highlight and more
brew "git"
brew "gnupg" # GNU Pretty Good Privacy (PGP) package
brew "graphviz"
brew "hivemind" # The mind to rule processes of your development environment
brew "hub" # Add GitHub support to git on the command-line
brew "eddieantonio/eddieantonio/imgcat" # It's like cat(1), but for images.
brew "fzf" # Fuzzy-finder - used for fuzzy searching terminal history
brew "imagemagick" # Tools and libraries to manipulate images in many formats (used by Rails ActiveStorage)
brew "lefthook" # Pre-commit hooks
brew "libtool" # Generic library support script
brew "libyaml" # YAML Parser
brew "memcached", restart_service: true
brew "neovim"
brew "openssl@1.1"
brew "openssl"
brew "tmux" # Terminal multiplexer
brew "overmind"
brew "pkg-config" # Manage compile and link flags for libraries
brew "rabbitmq", restart_service: true
brew "readline" # Library for command-line editing
brew "redis", restart_service: true
brew "ripgrep"
brew "stow"
brew "tig" # Text interface for Git repositories
brew "trash" # CLI tool that moves files or folder to the trash
brew "vim"
brew "yarn"
brew "zsh"
brew "zsh-completions"

cask "1password"
cask "1password-cli"
cask "alfred"
cask "google-chrome"
cask "chromedriver"
cask "dash"
cask "discord"
cask "dropbox"
cask "gifox"
cask "google-drive"
cask "iterm2"
cask "ngrok"
cask "postico"
cask "rectangle"
cask "rocket"
cask "slack"
cask "spotify"
